Информационная_база/src/Catalogs/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗагрузки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТабличнойЧасти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МаппингПолей</name>
    <attributes>
      <name>НомерКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/Catalogs/МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Перем ПолныйПутьОбъектЗагрузки;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("ОбъектЗагрузки", ОбъектЗагрузки);
		ДанныеЗаполнения.Свойство("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
		ДанныеЗаполнения.Свойство("ПолныйПутьОбъектЗагрузки", ПолныйПутьОбъектЗагрузки);
		ДанныеЗаполнения.Свойство("Пользователь", Пользователь);
		
		ПолныйПутьОбъектЗагрузки = ?(ПолныйПутьОбъектЗагрузки = Неопределено, "", ПолныйПутьОбъектЗагрузки);
		
		ВыбранныеПоля = Неопределено;
		Если ДанныеЗаполнения.Свойство("ВыбранныеПоля", ВыбранныеПоля) Тогда
			
			Если ТипЗнч(ВыбранныеПоля) = Тип("Соответствие") Тогда
				
				ДоступныеПоляЗагрузкиДанных = Справочники.МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника.ДоступныеПоляЗагрузкиДанныхИзВнешнегоИсточника(ОбъектЗагрузки, ИмяТабличнойЧасти, Истина, ПолныйПутьОбъектЗагрузки);
				Для каждого ЭлементСоответствия Из ВыбранныеПоля Цикл
					
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("Строка") Тогда
						
						ОписаниеПоля = ДоступныеПоляЗагрузкиДанных[ЭлементСоответствия.Ключ];
						
					Иначе
						
						ОписаниеПоля = Строка(ЭлементСоответствия.Ключ);
						
					КонецЕсли;
					
					Если ОписаниеПоля = Неопределено Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					НоваяСтрока = МаппингПолей.Добавить();
					НоваяСтрока.НомерКолонки		= ЭлементСоответствия.Значение;
					НоваяСтрока.ПредставлениеПоля	= ОписаниеПоля;
					
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("Строка") Тогда
						
						НоваяСтрока.ИмяПоля = ЭлементСоответствия.Ключ;
						
					Иначе
						
						НоваяСтрока.ДополнительныйРеквизит = ЭлементСоответствия.Ключ;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
